Repository: pancakevirus/nim-lang-081-docs-archived
Catalog: docs/OmegaT/OmegaT-level2.tmx
Source language: en_us
Languages: ja

source: discard echo columns[0] # Output: # (name: "id", tableName: "my_table", typ: (kind: dbNull, # notNull: false, name: "INTEGER", size: 0, maxReprLen: 0, precision: 0, # scale: 0, min: 0, max: 0, validValues: @[]), primaryKey: false, # foreignKey: false) db.close()
ja: discard echo columns[0] # 出力: # (name: "id", tableName: "my_table", typ: (kind: dbNull, # notNull: false, name: "INTEGER", size: 0, maxReprLen: 0, precision: 0, # scale: 0, min: 0, max: 0, validValues: @[]), primaryKey: false, # foreignKey: false) db.close()

source: doAssert watchdoge >= 0 ## Check for errors.
ja: doAssert watchdoge >= 0 ## エラーの確認。

source: errExprExpected ## expr expected
ja: errExprExpected ## 式を検出した

source: jsonArrayStart, ## start of an array: the ``[`` token
ja: jsonArrayStart, ## 配列の開始: ``[`` トークン

source: precision*, scale*: Natural ## precision and scale of the number
ja: precision*, scale*: Natural ## 数値の精度と尺度

source: release*, ## Current release level of this implementation.
ja: release*, ## この実装における現在のリリース・レベル。

source: tagB, ## the HTML ``b`` element
ja: tagB, ## HTML ``b`` 要素

source: tagTr, ## the HTML ``tr`` element
ja: tagTr, ## HTML ``tr`` 要素

source: tagTrack, ## the HTML ``track`` element
ja: tagTrack, ## HTML ``track`` 要素

source: tagTt, ## the HTML ``tt`` element
ja: tagTt, ## HTML ``tt`` 要素

source: cmsg_type*: cint ## Protocol-specific type.
ja: cmsg_type*: cint ## 特定のプロトコルにおける種類。

source: cuid*: Uid ## Creator's user ID.
ja: cuid*: Uid ## 作成者のユーザ ID

source: echo gtWhitespace # Maybe you want "visible" whitespaces?.
ja: echo gtWhitespace # ホワイトスペースを「表示可能」にしますか？

source: gl_offs*: int ## Slots to reserve at the beginning of gl_pathv.
ja: gl_offs*: int ## gl_pathv 開始時に予約するスロット。

source: gr_mem*: cstringArray ## Pointer to a null-terminated array of character
ja: gr_mem*: cstringArray ## メンバ名の文字ポインタにおける

source: l_start*: Off ## Relative offset in bytes.
ja: l_start*: Off ## バイトによる相対オフセット。

source: mq_msgsize*: int ## Maximum message size.
ja: mq_msgsize*: int ## 最大メッセージサイズ。

source: msg_iov*: ptr IOVec ## Scatter/gather array.
ja: msg_iov*: ptr IOVec ## 散布・集積配列。

source: pw_gid*: Gid ## Numerical group ID.
ja: pw_gid*: Gid ## 数値によるグループ ID

source: revents*: cshort ## The output event flags (see below).
ja: revents*: cshort ## 出力イベントのフラグ (後述参照)。

source: sigev_value*: SigVal ## Signal value.
ja: sigev_value*: SigVal ## シグナル値。

source: sin6_flowinfo*: int32 ## IPv6 traffic class and flow information.
ja: sin6_flowinfo*: int32 ## IPv6 IPv6 トラフィック・クラスとフロー情報。

source: sin_addr*: InAddr ## IP address.
ja: sin_addr*: InAddr ## IP ドレス。

source: ss_flags*: cint ## Flags.
ja: ss_flags*: cint ## フラグ。

source: st_mode*: Mode ## Mode of file (see below).
ja: st_mode*: Mode ## ファイルモード (後述参照)。

source: tm_hour*: cint ## Hour [0,23].
ja: tm_hour*: cint ## 時 [0,23]

source: tagU, ## the deprecated HTML ``u`` element
ja: tagU, ## 廃止された HTML ``u`` 要素

source: tagUl, ## the HTML ``ul`` element
ja: tagUl, ## HTML ``ul`` 要素

source: tagVar, ## the HTML ``var`` element
ja: tagVar, ## HTML ``var`` 要素

source: ## a null pointer.
ja: ## NULL ポインタで終端します。

source: tagVideo, ## the HTML ``video`` element
ja: tagVideo, ## HTML ``video`` 要素

source: tagWbr ## the HTML ``wbr`` element
ja: tagWbr ## HTML ``wbr`` 要素

source: dbUInt, ## some unsigned integer type
ja: dbUInt, ## 符号なし整数型

source: h_addrtype*: cint ## Address type.
ja: h_addrtype*: cint ## アドレスの種類。

source: jsonArrayEnd ## end of an array: the ``]`` token
ja: jsonArrayEnd ## 配列の終了: ``]`` トークン

source: tagBase, ## the HTML ``base`` element
ja: tagBase, ## HTML ``base`` 要素

source: commandLine, ## experimental: the command line passed to Nim
ja: commandLine, ## 試験機能: Nim に渡されるコマンドライン

source: d assert k == @["bird"] ## seq with initialSize: let x = collect(newSeqOfCap(4)):
ja: d assert k == @["bird"] ## initialSize がある seq: let x = collect(newSeqOfCap(4)):

source: myClosure = proc () = echo fmt"{i} * {j} = 42" myClosure() # output: 6 * 7 == 42 let m = @[proc (s: string): string = "to " & s, proc (s: string): string = "not to " & s] var l = m.mapIt(capture(it, proc (s: string): string = it(s))) let r = l.mapIt(it("be")) echo r[0] & ", or " & r[1] # output: to be, or not to be
ja: myClosure = proc () = echo fmt"{i} * {j} = 42" myClosure() # 出力: 6 * 7 == 42 let m = @[proc (s: string): string = "to " & s, proc (s: string): string = "not to " & s] var l = m.mapIt(capture(it, proc (s: string): string = it(s))) let r = l.mapIt(it("be")) echo r[0] & ", or " & r[1] # 出力: to be, または not to be

source: n_addrtype*: cint ## The address type of the network.
ja: n_addrtype*: cint ## ネットワークにおけるアドレスの種類。

source: uc_stack*: Stack ## The stack used by this context.
ja: uc_stack*: Stack ## このコンテキストで使うスタック。

source: version*, ## Current version level of this release.
ja: version*, ## このリリースにおける現在のバージョン・レベル。

source: d_ino*: Ino ## File serial number.
ja: d_ino*: Ino ## ファイルのシリアル番号。

source: doAssert inotify_rm_watch(inoty, watchdoge) >= 0 ## Remove directory from the watchdog
ja: doAssert inotify_rm_watch(inoty, watchdoge) >= 0 ## ウォッチドック (監視先) からディレクトリを除外します。

source: # inside foo #back to last dir
ja: # foo ディレクトリから # 最後のディレクトリへ復帰

source: fmRead, ## Open the file for read access only.
ja: fmRead, ## 読み取りアクセス専用でファイルを開きます。

source: ai_addr*: ptr SockAddr ## Socket address of socket.
ja: ai_addr*: ptr SockAddr ## ソケットのソケットアドレス。

source: bytesFinished*: BiggestInt ## Bytes transferred.
ja: bytesFinished*: BiggestInt ## 転送済みバイト数。

source: dbDecimal, ## decimal numbers (fixed-point number)
ja: dbDecimal, ## 十進数 (固定小数点数)

source: mask* {...}{.importc: "mask".}: uint32 ## Watch mask.
ja: mask* {...}{.importc: "mask".}: uint32 ## 監視用マスク。

source: tagBdi, ## the HTML ``bdi`` element
ja: tagBdi, ## HTML ``bdi`` 要素

source: cgid*: Gid ## Creator's group ID.
ja: cgid*: Gid ## 作成者のグループ ID

source: hostname*: string ## The hostname of the client that made the request.
ja: hostname*: string ## リクエストをしたクライアントのホスト名。

source: l_len*: Off ## Size; if 0 then until EOF.
ja: l_len*: Off ## サイズ。 0 ならば EOF までのサイズとなります。

source: linkOptions, ## additional options passed to the linker
ja: linkOptions, ## リンカに渡される追加オプション

source: mq_curmsgs*: int ## Number of messages currently queued.
ja: mq_curmsgs*: int ## 現在、キューにあるメッセージ数。

source: pw_dir*: cstring ## Initial working directory.
ja: pw_dir*: cstring ## 初期作業ディレクトリ。

source: sigev_notify_function*: proc (x: SigVal) {...}{.noconv.} ## Notification func.
ja: sigev_notify_function*: proc (x: SigVal) {...}{.noconv.} ## 通知関数。

source: sin6_addr*: In6Addr ## IPv6 address.
ja: sin6_addr*: In6Addr ## IPv6 アドレス。

source: st_nlink*: Nlink ## Number of hard links to the file.
ja: st_nlink*: Nlink ## ファイルのハードリンク数。

source: tm_mday*: cint ## Day of month [1,31].
ja: tm_mday*: cint ## 今月の経過日数 [1,31]

source: 2) == Row(@["2", "item#2"]) # Returns empty. doAssert db.getRow(sql"INSERT INTO my_table (id, name) VALUES (?, ?)",
ja: 2) == Row(@["2", "item#2"]) # 空文字を返します。 doAssert db.getRow(sql"INSERT INTO my_table (id, name) VALUES (?, ?)",

source: echo "LoopIndex = ", i, ", InsertID = ", id # Output: # LoopIndex = 0, InsertID = 1 # LoopIndex = 1, InsertID = 2 # LoopIndex = 2, InsertID = 3 db.close()
ja: echo "LoopIndex = ", i, ", InsertID = ", id # 出力: # LoopIndex = 0, InsertID = 1 # LoopIndex = 1, InsertID = 2 # LoopIndex = 2, InsertID = 3 db.close()

source: echo "length:" & $len(row) # Output: # id:1 # name:item#1 # length:2 # id:2 # name:item#2 # length:2 db.close()
ja: echo "length:" & $len(row) # 出力: # id:1 # name:item#1 # length:2 # id:2 # name:item#2 # length:2 db.close()

source: f_bfree*: Fsblkcnt ## Total number of free blocks.
ja: f_bfree*: Fsblkcnt ## 合計空きブロック数。

source: msg_iovlen*: cint ## Members in msg_iov.
ja: msg_iovlen*: cint ## msg_iov のメンバ。

source: sched_ss_init_budget*: Timespec ## Initial budget for sporadic server.
ja: sched_ss_init_budget*: Timespec ## スポラディックサーバーの初期確保量。

source: si_pid*: Pid ## Sending process ID.
ja: si_pid*: Pid ## 送信プロセス ID

source: chan.send("Another message") # Initialize the channel. chan.open() # Launch the worker. var worker1: Thread[void] createThread(worker1, firstWorker) # Block until the message arrives, then print it out. echo chan.recv() # "Hello World!" # Wait for the thread to exit before moving on to the next example. worker1.joinThread() # Launch the other worker. var worker2: Thread[void] createThread(worker2, secondWorker) # This time, use a non-blocking approach with tryRecv. # Since the main thread is not blocked, it could be used to perform other # useful work while it waits for data to arrive on the channel. while true:
ja: chan.send("Another message") # チャンネルの初期化。 chan.open() # ワーカーを起動します。 var worker1: Thread[void] createThread(worker1, firstWorker) # メッセージが到着するまでブロックを行い、到着後に出力表示をします。 echo chan.recv() # "Hello World!" # 次の用例へ移動する前に第二スレッドの終了を待機します。 worker1.joinThread() # ほかのワーカーを起動します。 var worker2: Thread[void] createThread(worker2, secondWorker) # 今回は tryRecv でノンブロッキング手法を使います。 # データがチャンネルに到着するのを待機する間、 # メインスレッドはブロックされないため、ほかの有用な作業をするために使えます。 while true:

source: dbFloat, ## some floating point type
ja: dbFloat, ## 浮動小数点型

source: h_length*: cint ## The length, in bytes, of the address.
ja: h_length*: cint ## バイト単位によるアドレス長。

source: min*, max*: BiggestInt ## the minimum and maximum of allowed values
ja: min*, max*: BiggestInt ## 有効範囲内の最小・最大値

source: tagBdo, ## the deprecated HTML ``dbo`` element
ja: tagBdo, ## 廃止された HTML ``dbo`` 要素

source: ## the second line
ja: ## 二行目

source: compileOptions, ## additional options passed to the C/C++ compiler
ja: compileOptions, ## C/C++ コンパイラに渡される追加オプション

source: n_net*: int32 ## The network number, in host byte order.
ja: n_net*: int32 ## ホスト・バイトオーダー形式によるネットワーク番号。

source: nkReferences, nkDefault, nkCheck, nkConstraint, nkUnique, nkIdentity, nkColumnDef, ## name, datatype, constraints
ja: nkReferences, nkDefault, nkCheck, nkConstraint, nkUnique, nkIdentity, nkColumnDef, ## 名前、データ型、制約

source: uc_mcontext*: Mcontext ## A machine-specific representation of the saved
ja: uc_mcontext*: Mcontext ## マシン依存形式で保存された

source: ## the third line
ja: ## 三行目

source: dbDate, ## a year-month-day description
ja: dbDate, ## 年-月-日の説明

source: speed*: BiggestInt ## Speed in bytes/s
ja: speed*: BiggestInt ## バイト / 秒による転送速度

source: tagBasefont, ## the deprecated HTML ``basefont`` element
ja: tagBasefont, ## 廃止された HTML ``basefont`` 要素

source: ## If values are invalid then ``default`` is returned.
ja: ## 不正値ならば ``default`` を返します。

source: ai_addrlen*: SockLen ## Length of socket address.
ja: ai_addrlen*: SockLen ## ソケットのアドレス長。

source: ai_next*: ptr AddrInfo ## Pointer to next in list.
ja: ai_next*: ptr AddrInfo ## 次のリストへのポインタ。

source: ccompilerPath ## the path to the C/C++ compiler
ja: ccompilerPath ## C/C++ コンパイラのパス

source: l_pid*: Pid ## Process ID of the process holding the lock;
ja: l_pid*: Pid ##ロック権があるプロセスのプロセスID。

source: mode*: Mode ## Read/write permission.
ja: mode*: Mode ## 読み取り・書き込み権限。

source: pw_shell*: cstring ## Program to use as shell.
ja: pw_shell*: cstring ## シェルとして使うプログラム。

source: sin6_scope_id*: int32 ## Set of interfaces for a scope.
ja: sin6_scope_id*: int32 ## スコープのインターフェース設定。

source: st_uid*: Uid ## User ID of file.
ja: st_uid*: Uid ## ファイルのユーザ ID

source: tm_mon*: cint ## Month of year [0,11].
ja: tm_mon*: cint ## 今年の経過月数 [0,11]

source: # only output when it comes from "temp.nim"
ja: # "temp.nim" 由来であるときに限り出力します

source: msg_control*: pointer ## Ancillary data; see below.
ja: msg_control*: pointer ## 補助データバッファ。後述参照。

source: sched_ss_max_repl*: cint ## Maximum pending replenishments for
ja: sched_ss_max_repl*: cint ## スポラディックサーバーの

source: si_uid*: Uid ## Real user ID of sending process.
ja: si_uid*: Uid ## 送信プロセスの実ユーザー ID

source: dbTime, ## HH:MM:SS information
ja: dbTime, ## 時:分:秒の情報

source: tagBig, ## the HTML ``big`` element
ja: tagBig, ## HTML ``big`` 要素

source: bgBlack = 40, ## black
ja: bgBlack = 40, ## 黒

source: case kind*: SqlNodeKind ## kind of syntax tree
ja: case kind*: SqlNodeKind ## シンタックスツリーの種類

source: dbUnknown, ## unknown datatype
ja: dbUnknown, ## 未知のデータ型

source: errNone, ## no error
ja: errNone, ## エラーなし

source: fgBlack = 30, ## black
ja: fgBlack = 30, ## 黒

source: fpUserExec, ## execute access for the file owner
ja: fpUserExec, ## ファイル所有者の実行アクセス権

source: jsonError, ## an error occurred during parsing
ja: jsonError, ## 構文解析中のエラー発生

source: kind*: DbTypeKind ## the kind of the described type
ja: kind*: DbTypeKind ## 型表現の種類

source: methodNone, ## no REQUEST_METHOD environment variable
ja: methodNone, ## 環境変数 REQUEST_METHOD が存在しない

source: name*: string ## name of the column
ja: name*: string ## カラムの名前

source: pcFile, ## path refers to a file
ja: pcFile, ## ファイルの参照パス

source: poEchoCmd, ## Echo the command before execution.
ja: poEchoCmd, ## コマンドの実行前にエコー (確認表示) します。

source: res: PPGresult ## used to get a row's
ja: res: PPGresult ## 行の取得で使われます

source: resetStyle, ## reset attributes
ja: resetStyle, ## 属性のリセット

source: roSkipPounds, ## skip ``#`` at line beginning (documentation
ja: roSkipPounds, ## ``#`` で始まる行は読み飛します

source: sexpError, ## an error occurred during parsing
ja: sexpError, ## 構文解析中にエラーが発生した

source: startA*: int ## Start Line number in Data A.
ja: startA*: int ## データ A の開始行数。

source: styleBright = 1, ## bright text
ja: styleBright = 1, ## 高輝度テキスト

source: tagUnknown, ## unknown HTML element
ja: tagUnknown, ## 未知の HTML 要素

source: xnText, ## a text element
ja: xnText, ## text 要素

source: echo x # some text # <!-- this is comment --> # <secondTag>&some entity;<![CDATA[some cdata]]></secondTag>
ja: echo x # テキスト # <!-- これはコメントです --> # <secondTag>&エンティティ;<![CDATA[some cdata]]></secondTag>

source: currentJob*: FtpJobType ## The current job being performed.
ja: currentJob*: FtpJobType ## 現在実行中の処理。

source: dbDatetime, ## year-month-day and HH:MM:SS information,
ja: dbDatetime, ## 年-月-日と時:分:秒の情報、

source: sa_flags*: cint ## Special flags.
ja: sa_flags*: cint ## 特殊フラグ。

source: tagBlockquote, ## the HTML ``blockquote`` element
ja: tagBlockquote, ## HTML ``blockquote`` 要素

source: validValues*: seq[string] ## valid values of an enum or a set
ja: validValues*: seq[string] ## 列挙型または集合の有効値

source: st_gid*: Gid ## Group ID of file.
ja: st_gid*: Gid ## ファイルのグループ ID

source: tm_year*: cint ## Years since 1900.
ja: tm_year*: cint ## 1900 年からの経過年数。

source: ## sporadic server.
ja: ## 最大補充保留数。

source: msg_controllen*: SockLen ## Ancillary data buffer len.
ja: msg_controllen*: SockLen ## 補助データバッファ長。

source: si_addr*: pointer ## Address of faulting instruction.
ja: si_addr*: pointer ## フォールト命令のアドレス。

source: f_files*: Fsfilcnt ## Total number of file serial numbers.
ja: f_files*: Fsfilcnt ## ファイルの合計シリアル番号数。

source: tagBody, ## the HTML ``body`` element
ja: tagBody, ## HTML ``body`` 要素

source: dbTimestamp, ## Timestamp values are stored as the number of seconds
ja: dbTimestamp, ## タイムスタンプ値には UNIX エポック時間からの経過秒数が格納されます。

source: acquire(L) # lock stdout
ja: acquire(L) # 標準出力 (stdout) のロック

source: cookie* {...}{.importc: "cookie".}: uint32 ## Cookie to synchronize two events.
ja: cookie* {...}{.importc: "cookie".}: uint32 ## イベント同士の同期用クッキー。

source: tagBr, ## the HTML ``br`` element
ja: tagBr, ## HTML ``br`` 要素

source: st_rdev*: Dev ## Device ID (if file is character or block special).
ja: st_rdev*: Dev ## デバイス ID (ファイルがキャラクタまたはブロック専用の場合)。

source: tm_wday*: cint ## Day of week [0,6] (Sunday =0).
ja: tm_wday*: cint ## 今週の経過日数 [0,6] (日曜日=0)。

source: ## This type contains a description of a person
ja: ## この型には person の説明があります

source: ## `numValues` stores the number of values
ja: ## `numValues` には数値を格納します

source: This evaluates `arg` multiple times!
ja: これにより `arg` は何度も評価されます！

source: d_reclen*: cshort ## Length of this record.
ja: d_reclen*: cshort ## このレコードの長さ

source: dbTimeInterval, ## an interval [a,b] of times
ja: dbTimeInterval, ## [a,b] のインターバルタイム

source: echo gtOperator # Maybe you want Operators to use a specific color?.
ja: echo gtOperator # 演算子に色を指定しますか？

source: msg_flags*: cint ## Flags on received message.
ja: msg_flags*: cint ## 受信メッセージのフラグ。

source: si_status*: cint ## Exit value or signal.
ja: si_status*: cint ## 終了値またはシグナル。

source: # Create a thread which will receive the channel as an argument.
ja: # 引数としてチャンネルを得るスレッドを作成します。

source: # why does it process temp.nim here?
ja: # ここで temp.nim を処理する理由は？

source: f_ffree*: Fsfilcnt ## Total number of free file serial numbers.
ja: f_ffree*: Fsfilcnt ## ファイルの合計空きシリアル番号数。

source: sigev_notify_attributes*: ptr Pthread_attr ## Notification attributes.
ja: sigev_notify_attributes*: ptr Pthread_attr ## 通知属性。

source: tagButton, ## the HTML ``button`` element
ja: tagButton, ## HTML ``button`` 要素

source: dbEnum, ## some enum
ja: dbEnum, ## 列挙型

source: tagCanvas, ## the HTML ``canvas`` element
ja: tagCanvas, ## HTML ``canvas`` 要素

source: d_type*: int8 ## Type of file; not supported by all filesystem types.
ja: d_type*: int8 ## ファイルの種類。すべてのファイルシステム形式でサポートされているわけでありません

source: st_size*: Off ## For regular files, the file size in bytes.
ja: st_size*: Off ## 通常ファイルでは、バイト単位によるファイルサイズ。

source: tm_yday*: cint ## Day of year [0,365].
ja: tm_yday*: cint ## 今年の経過日数 [0,365]

source: dbSet, ## set of enum values
ja: dbSet, ## 列挙値の集合

source: si_band*: int ## Band event for SIGPOLL.
ja: si_band*: int ## SIGPOLL のバンドイベント。

source: f_favail*: Fsfilcnt ## Number of file serial numbers available to
ja: f_favail*: Fsfilcnt ## 非特権プロセスで利用できる

source: tagCaption, ## the HTML ``caption`` element
ja: tagCaption, ## HTML ``caption`` 要素

source: dbArray, ## an array of values
ja: dbArray, ## 配列の値

source: # Use paramStr() here else:
ja: # ここで paramStr() を使います else:

source: fmWrite, ## Open the file for write access only.
ja: fmWrite, ## 書き込みアクセス専用でファイルを開きます。

source: let inoty: FileHandle = inotify_init() ## Create 1 Inotify.
ja: let inoty: FileHandle = inotify_init() ## Inotify 単体を作成します。

source: tagCenter, ## the deprecated HTML ``center`` element
ja: tagCenter, ## 廃止された HTML ``center`` 要素

source: tm_isdst*: cint ## Daylight Savings flag.
ja: tm_isdst*: cint ## 夏時間のフラグ。

source: dbComposite, ## composite type (record, struct, etc)
ja: dbComposite, ## 複合型 (レコード、構造体など)

source: si_value*: SigVal ## Signal value.
ja: si_value*: SigVal ## シグナル値。

source: tagCite, ## the HTML ``cite`` element
ja: tagCite, ## HTML ``cite`` 要素

source: f_fsid*: int ## File system ID.
ja: f_fsid*: int ## ファイルシステムの ID

source: len* {...}{.importc: "len".}: uint32 ## Length (including NULs) of name.
ja: len* {...}{.importc: "len".}: uint32 ## name の長さ (ナル文字類も算入)。

source: dbUrl, ## a URL
ja: dbUrl, ## URL

source: tagCode, ## the HTML ``code`` element
ja: tagCode, ## HTML ``code`` 要素

source: dbUuid, ## a UUID
ja: dbUuid, ## UUID

source: tagCol, ## the HTML ``col`` element
ja: tagCol, ## HTML ``col`` 要素

source: ## embedded in Nim comments)
ja: ## (Nim コメントによる埋め込みドキュメンテーション)

source: bar: string let x = Foo(id: 1, bar: "baz") ## serialize: let y = $$x assert y == """{"id": 1, "bar": "baz"}"""
ja: bar: string let x = Foo(id: 1, bar: "baz") ## シリアライズ: let y = $$x assert y == """{"id": 1, "bar": "baz"}"""

source: bar: string let y = """{"id": 1, "bar": "baz"}""" assert typeof(y) is string ## deserialize to type 'Foo': let z = to[Foo](y) assert typeof(z) is Foo assert z.id == 1 assert z.bar == "baz"
ja: bar: string let y = """{"id": 1, "bar": "baz"}""" assert typeof(y) is string ## 'Foo' 型へのデシリアライズ: let z = to[Foo](y) assert typeof(z) is Foo assert z.id == 1 assert z.bar == "baz"

source: bufpos*: int ## the current position within the buffer
ja: bufpos*: int ## バッファ内の現在位置

source: dbSerial, ## datatype used for primary auto-increment keys
ja: dbSerial, ## 自動インクリメントのプライマリキーで使われるデータ型

source: errInvalidToken, ## invalid token
ja: errInvalidToken, ## 不正なトークン

source: errors*: seq[string] ## All detected parsing errors.
ja: errors*: seq[string] ## 検出された構文解析エラー。

source: fgColor, ## set foreground's true color
ja: fgColor, ## トゥルーカラーによるターミナルの文字表示色の設定

source: fpUserWrite, ## write access for the file owner
ja: fpUserWrite, ## ファイル所有者の書き込みアクセス権

source: jsonEof, ## end of file reached
ja: jsonEof, ## ファイル終端へ到達

source: methodPost, ## query uses the POST method
ja: methodPost, ## POST メソッドの照会時に使用

source: pcLinkToFile, ## path refers to a symbolic link to a file
ja: pcLinkToFile, ## シンボリックリンクによるファイルの参照パス

source: re*, im*: T ## A complex number, consisting of a real and an imaginary part.
ja: re*, im*: T ## 実数部と虚数部から構成される複素数です。

source: sexpEof, ## end of file reached
ja: sexpEof, ## ファイル終端へ到達

source: tagA, ## the HTML ``a`` element
ja: tagA, ## HTML ``a`` 要素

source: xnElement, ## an element with 0 or more children
ja: xnElement, ## 0 個以上の子要素

source: f_flag*: int ## Bit mask of f_flag values.
ja: f_flag*: int ## f_flag 値のビットマスク。

source: st_atim*: Timespec ## Time of last access.
ja: st_atim*: Timespec ## 最終アクセス時刻。

source: dbInet, ## an IP address
ja: dbInet, ## IP アドレス

source: d_off*: Off ## Not an offset.
ja: d_off*: Off ## オフセットではありません。

source: tagColgroup, ## the HTML ``colgroup`` element
ja: tagColgroup, ## HTML ``colgroup`` 要素

source: ## Register new Mimetypes.
ja: ## 新しい Mimetypes を登録します。

source: dbMacAddress, ## a MAC address
ja: dbMacAddress, ## MAC アドレス

source: echo toknizr.kind # All the kinds of tokens can be processed here.
ja: echo toknizr.kind # ここでトークン全種を処理します。

source: st_mtim*: Timespec ## Time of last data modification.
ja: st_mtim*: Timespec ## データの最終修正時刻。

source: tagCommand, ## the HTML ``command`` element
ja: tagCommand, ## HTML ``command`` 要素

source: f_namemax*: int ## Maximum filename length.
ja: f_namemax*: int ## ファイル名の最大長。

source: dbGeometry, ## some geometric type
ja: dbGeometry, ## ジオメトリック型

source: tagDatalist, ## the HTML ``datalist`` element
ja: tagDatalist, ## HTML ``datalist`` 要素

source: # Clean up resources.
ja: # リソースのクリーンアップ。

source: roSupportSmilies, ## make the RST parser support smilies like ``:)``
ja: roSupportSmilies, ## ``:)`` などの顔文字を RST パーサーでサポート可能にします

source: setTestData("name", "Klaus", "password", "123456") # read the data into `myData` var myData = readData() # check that the data's variable names are "name" or "password" validateData(myData, "name", "password") # start generating content: writeContentType() # generate content: write(stdout, "<!DOCTYPE HTML PUBLIC \"-//W3C//DTD HTML 4.01//EN\">\n") write(stdout, "<html><head><title>Test</title></head><body>\n") writeLine(stdout, "your name: " & myData["name"]) writeLine(stdout, "your password: " & myData["password"]) writeLine(stdout, "</body></html>")
ja: setTestData("name", "Klaus", "password", "123456") # `myData`にあるデータを読み取ります var myData = readData() # データの変数名として "name" または "password" を確認します。 validateData(myData, "name", "password") # コンテンツの生成開始: writeContentType() # コンテンツの生成部: write(stdout, "<!DOCTYPE HTML PUBLIC \"-//W3C//DTD HTML 4.01//EN\">\n") write(stdout, "<html><head><title>Test</title></head><body>\n") writeLine(stdout, "your name: " & myData["name"]) writeLine(stdout, "your password: " & myData["password"]) writeLine(stdout, "</body></html>")

source: dbPoint, ## Point on a plane (x,y)
ja: dbPoint, ## 平面上の地点 (x,y)

source: st_ctim*: Timespec ## Time of last status change.
ja: st_ctim*: Timespec ## ステータスの最終変更時刻。

source: name* {...}{.importc: "name".}: char ## Name.
ja: name* {...}{.importc: "name".}: char ## 名前。

source: tagDd, ## the HTML ``dd`` element
ja: tagDd, ## HTML ``dd`` 要素

source: d_pino*: Ino ## Parent inode (only for queries) (not POSIX)
ja: d_pino*: Ino ## 親 inode (クエリ専用) (非 POSIX)

source: dbLine, ## Infinite line ((x1,y1),(x2,y2))
ja: dbLine, ## 無限長の線 ((x1,y1),(x2,y2))

source: tagDel, ## the HTML ``del`` element
ja: tagDel, ## HTML ``del`` 要素

source: dbLseg, ## Finite line segment ((x1,y1),(x2,y2))
ja: dbLseg, ## 有限長の線分 ((x1,y1),(x2,y2))

source: st_atime*: Time ## Time of last access.
ja: st_atime*: Time ## 最終アクセス時刻。
